/*************************************************
 Copyright ? 0010. All rights reserved.

// 文件名
@ File name: my_config.h -- 自定义的整个工程的配置文件
// 作者、工号、版本及完成日期
@ Author:    ya
@ ID：       0011
@ Version:
@ Date:
// 用于详细说明此程序文件完成的主要功能，与其他模块
// 或函数的接口，输出值、取值范围、含义及参数间的控
// 制、顺序、独立或依赖等关系
@ Description:
            用于定义各个模块与MCU相连接的接口和端口相关的时钟，方便移植，
            若不适用此文件，各个模块的源文件会使用默认的端口配置

@ Others:  // 其它内容的说明
@ History: // 修改历史记录列表，每条修改记录应包括修改日期、修改
|		   // 者及修改内容简述
|--@ 1. Date:
|--@ Author:
|--@ ID:
|--@ Modification:
|--@ 2. ...
*************************************************/
#ifndef __MY_CONFIG_H
#define __MY_CONFIG_H

#if 1 // 该头文件是否使能的开关

#include "stm32f4xx.h"
// ============================================================================================
// ===============================================================================
//-----------------温湿度传感器DHT11端口相关定义----------------
// 温湿度传感器DHT11的DATA数据引脚对应的端口
#define DHT11_DATA_PORT                     GPIOG
// 温湿度传感器DHT11的DATA数据引脚对应的端口的引脚号
#define DHT11_DATA_PIN                      GPIO_Pin_9
// 温湿度传感器DHT11的DATA数据引脚的时钟使能函数
#define DHT11_DATA_RCC_CMD                  RCC_AHB1PeriphClockCmd
// 温湿度传感器DHT11的DATA数据引脚的时钟
#define DHT11_DATA_RCC                      RCC_AHB1Periph_GPIOG
//-----------------温湿度传感器DHT11端口相关定义----------------
// ===============================================================================
// ============================================================================================
// ============================================================================================
// ===============================================================================
//-----------------紫外线LED控制端口相关定义----------------
// 紫外线LED控制引脚对应的端口
#define ULTRAVIOLET_LIGHT_PORT              GPIOC
// 紫外线LED控制引脚对应的端口的引脚号
#define ULTRAVIOLET_LIGHT_PIN               GPIO_Pin_7
// 紫外线LED控制引脚对应的端口的时钟使能函数
#define ULTRAVIOLET_LIGHT_RCC_CMD           RCC_AHB1PeriphClockCmd
// 紫外线LED控制引脚对应的端口的时钟
#define ULTRAVIOLET_LIGHT_RCC               RCC_AHB1Periph_GPIOC
//-----------------紫外线LED控制端口相关定义----------------
// ===============================================================================
// ============================================================================================
// ============================================================================================
// ===============================================================================
//-----------------风扇控制端口相关定义----------------
// 风扇控制引脚对应的端口
#define FAN_PORT                            GPIOB
// 风扇控制引脚对应的端口的引脚号
#define FAN_PIN                             GPIO_Pin_3
// 风扇控制引脚对应的端口的时钟使能函数
#define FAN_RCC_CMD                         RCC_AHB1PeriphClockCmd
// 风扇控制引脚对应的端口的时钟
#define FAN_RCC                             RCC_AHB1Periph_GPIOB
// 风扇控制引脚复用的引脚资源
#define FAN_PIN_SOURCE                      GPIO_PinSource3
// 风扇控制引脚复用的外设资源
#define FAN_AF_PERIPHERAL                   GPIO_AF_TIM2
// 风扇控制引脚对应的定时器
#define FAN_TIM                             TIM2
// 风扇控制引脚对应的定时器的时钟使能函数
#define FAN_TIM_RCC_CMD                     RCC_APB1PeriphClockCmd
// 风扇控制引脚对应的定时器的时钟
#define FAN_TIM_RCC                         RCC_APB1Periph_TIM2
// 风扇控制引脚对应的定时器的输出通道使能函数
#define FAN_TIM_OC_INIT                     TIM_OC2Init
// 风扇控制引脚对应的定时器通道的预装载寄存器使能函数
#define FAN_TIM_PRELOAD_CONFIG              TIM_OC2PreloadConfig
//-----------------风扇控制端口相关定义----------------
// ===============================================================================
// ============================================================================================
// ============================================================================================
// ===============================================================================
//-----------------MS1100甲醛浓度检测模块的相关定义----------------
// 与甲醛浓度检测模块ADC输出相连接的GPIO端口
#define MS1100_PROT                         GPIOA
// 与甲醛浓度检测模块ADC输出相连接的GPIO端口的引脚号
#define MS1100_PIN                          GPIO_Pin_6
// 与甲醛浓度检测模块ADC输出相连接的GPIO端口的时钟使能函数
#define MS1100_RCC_CMD                      RCC_AHB1PeriphClockCmd
// 与甲醛浓度检测模块ADC输出相连接的GPIO端口的时钟
#define MS1100_RCC                          RCC_AHB1Periph_GPIOA
// 与甲醛浓度检测模块ADC输出相连接的GPIO端口复用到的ADC             
#define MS1100_ADC                          ADC1
// ADC的时钟使能函数
#define MS1100_ADC_RCC_CMD                  RCC_APB2PeriphClockCmd
// ADC的时钟
#define MS1100_ADC_RCC                      RCC_APB2Periph_ADC1
// ADC的规则通道
#define MS1100_ADC_REGULARCHANNEL           ADC_Channel_6
//-----------------MS1100甲醛检测模块的相关定义----------------
// ===============================================================================
// ============================================================================================

#endif // end 头文件使能

#endif
